Revit 2027 API
AreaBasedLoadType.LoadClassification Property
 The load classification of area based load type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LoadClassification { get; set; }
Public Property LoadClassification As ElementId
	Get
	Set
public:
property ElementId^ LoadClassification {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LoadClassification : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a load classification id .
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace